[
  {
    "url": "https://www.galapagos.org/newsroom/gibbs-on-floreana-tortoise/",
    "description": "On the Return of the Floreana Giant Tortoise | Galápagos Conservancy",
    "extended": "“For the first time in 180 years, Floreana lineage giant tortoises set foot on Floreana Island once again.”",
    "ts": "2026-02-25",
    "quotable": false
  },
  {
    "url": "https://www.nytimes.com/2026/02/18/opinion/ai-software.html?unlocked_article_code=1.NFA.Q5V5.RFhmZVUFQ04Z",
    "description": "Paul Ford on “The A.I. Disruption Has Arrived, and It Sure Is Fun”",
    "extended": "““All of the people I love hate this stuff, and all the people I hate love it. And yet, likely because of the same personality flaws that drew me to technology in the first place, I am annoyingly excited.” <= this.",
    "ts": "2026-02-18",
    "quotable": false
  },
  {
    "url": "https://www.carbonbrief.org/analysis-chinas-co2-emissions-have-now-been-flat-or-falling-for-21-months/",
    "description": "China’s CO2 emissions have now been ‘flat or falling’ for 21 months",
    "extended": "Despite adding 520 terawatt hours of demand in 2025",
    "ts": "2026-02-13",
    "quotable": false
  },
  {
    "url": "https://mashable.com/feature/carbon-footprint-pr-campaign-sham",
    "description": "BP popularized “carbon footprint” explicitly to shift the blame of climate change away from them and to individuals.",
    "extended": "Carbon footprint is very much in the tradition of plastic recycling, a scam designed to turn blame and focus inward away from real systemic solutions.",
    "ts": "2026-02-12",
    "quotable": false
  },
  {
    "url": "https://www.iankduncan.com/engineering/2026-02-09-what-functional-programmers-get-wrong-about-systems/",
    "description": "What Functional Programmers Get Wrong About Systems - Ian Duncan",
    "extended": "Good article on fetishization of code over the system that is in no way about AI (but is extremely relevant).",
    "ts": "2026-02-11",
    "quotable": false
  },
  {
    "url": "https://www.msn.com/en-us/society-culture-and-history/general/mexicans-are-refusing-to-spend-this-50-peso-bill/ar-AA1VW2lw",
    "description": "Mexicans are refusing to spend this 50-peso bill",
    "extended": "Axolotls are too cute. We brought home several to share with Riley, our axolotl, during our most recent México trip.",
    "ts": "2026-02-10",
    "quotable": false
  },
  {
    "url": "https://www.nature.com/articles/s41586-025-09922-y",
    "description": "Artificial intelligence tools expand scientists’ impact but contract science’s focus | Nature",
    "extended": "Heard about this paper on Volts this morning from Dr. Sarah Kapnick. Another instance where we're seeing individual benefits but not yet collective benefits. ",
    "ts": "2026-02-10",
    "quotable": false
  },
  {
    "url": "https://www.youtube.com/watch?v=YVnJ8LLGPsY",
    "description": "Sarah Taber: What Happened To Progressive Farmers?",
    "extended": "Love me a good history. Can't wait for part two. TL;DR: You become a farmer today by inheriting land. Inheritance based systems systems trend conservative (and to sub-optimal talent). Wealth and estate tax please.  ",
    "ts": "2026-02-09",
    "quotable": false
  },
  {
    "url": "https://storyseedlibrary.org/",
    "description": "Story Seed Library",
    "extended": "“a library of Solarpunk art and story seeds - helping you imagine a better climate future in which humanity learns how to sustainably live on Earth.”",
    "ts": "2026-02-07",
    "quotable": false
  },
  {
    "url": "https://www.theguardian.com/wellness/2026/jan/14/new-year-polycrisis-psychology-feeling-trapped",
    "description": "“I hadn’t fully grasped how much the idea of a better future sustained me”. On life in the polycrisis.",
    "extended": "Belief that we can make the world better is my core belief. Crazy as it sounds in 2026 that’s how I ended up in tech. And it’s a really daily struggle.",
    "ts": "2026-01-17",
    "quotable": false
  },
  {
    "url": "https://shows.acast.com/a-language-i-love-is/episodes/american-sign-language-and-aidan-elliott-mccrea",
    "description": "An introduction to the fascinating the linguistics and history of American Sign Language (and sign languages in general) on “A Language I Love Is...” podcast with Aidan Elliott-McCrea",
    "extended": "Listen to my brilliant brother talk about how the ASL word for computer is derived from “work” most places but “think” in Silicon Valley, and how 3rd person pro-nouns are referenced using spatial variables",
    "ts": "2025-12-23",
    "quotable": false
  },
  {
    "url": "https://lists.nanog.org/archives/list/nanog@lists.nanog.org/thread/ACADD3NKOG2QRWZ56OSNNG7UIEKKTZXL/",
    "description": "NTP at NIST Boulder has lost power - NANOG - lists.nanog.org",
    "extended": "Main NIST NTP servers are offline due to weather situation in Boulder",
    "ts": "2025-12-20",
    "quotable": false
  },
  {
    "url": "https://climatedrift.substack.com/p/why-solarpunk-is-already-happening",
    "description": "Why Solarpunk is already happening in Africa",
    "extended": "Parts of Africa are successfully deploying distributed grids on the back of collapsing harder cost, pay as you go mobile payments, and selling carbon offsets",
    "ts": "2025-11-22",
    "quotable": false
  },
  {
    "url": "https://www.theguardian.com/world/2025/nov/11/china-co2-emissions-flat-or-falling-for-past-18-months-analysis-finds",
    "description": "China’s CO2 emissions have been flat or falling for past 18 months, analysis finds",
    "extended": "““China’s carbon dioxide emissions have been flat or falling for 18 months, analysis reveals, adding evidence to the hope that the world’s biggest polluter has managed to hit its target of peak CO2 emissions well ahead of schedule.”",
    "ts": "2025-11-11",
    "quotable": false
  },
  {
    "url": "https://aphyr.com/posts/397-i-want-you-to-understand-chicago",
    "description": "I Want You to Understand Chicago",
    "extended": "Notes from a friend living in Chicago during a government terror campaign.",
    "ts": "2025-11-09",
    "quotable": false
  }
]